# task 1.
# написати програму, яка просить в користувача ввести через пробіл міста, в яких він був за минулі 10 років
# потім окремо запросити у користувача міста, куди він хоче поїхати внаступні 10 років
# вивести на екран повідомлення з текстом про те, що користувачу, мабуть, дуже сподобалося в містах, які він повторив в
# двох циклах вводу, а саме... (сформувати строку, використовуючи join)
# якщо повтору не було - вивести повідомлення, що користувач відкритий до чогось нового
# врахувати випадки, що користувач нічого не вводить не потрібно, в даному випадку вам явно зазначено,
# що ці перевірки не потрібні.
# не потрібно перевіряти введення цифр
# ми виходим із того, що користувач введе щось на зразок "Київ Тернопіль париЖ акапулько-80"
# В той же час врахуйте, що користувач може вводити дані в різних регістрах

# використати сети!!!

print( "Вітаю,введіть через пробіл міста, в яких, Ви, був за минулі 10 років, будь ласка.")
date_input = input("")
print(date_input)
print( "Дякую, а тепер введіть міста, куди, Ви, хотіли б  поїхати внаступні 10 років ")
date_input2 =  input("")
print(date_input2)